SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 10001
 Type ( Engine )
 WagonShape ( 10001.s )
 
 Size ( 2.8m 3.9m 18.48m )  
 Mass ( 131t )
 WheelRadius ( 21.0in)
 InertiaTensor ( Box ( 2.8m 3.9m 18.48m ) )

Coupling (
      Type ( Automatic )
      Spring (
     Stiffness ( 1e6N/m 5e6N/m )
     Damping ( 1e6N/m/s 1e6N/m/s )
     Break ( 6e9N 6e9N )
     r0 ( 20cm 30cm )
      )
   CouplingHasRigidConnection (1)
)
Coupling (
      Type ( Chain )
      Spring (
     Stiffness ( 1e6N/m 5e6N/m )
     Damping ( 1e6N/m/s 1e6N/m/s )
     Break ( 6e9N 6e9N )
     r0 ( 20cm 30cm )
      )
   CouplingHasRigidConnection (1)
)
Buffers (
  Spring (
   Stiffness ( 1e6N/m 5e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   r0 ( 0m 1e9 )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 0.5deg )
 )


 Adheasion ( 0 1 0.236 0 )
 DerailRailHeight ( 10cm )
 DerailRailForce ( 2.5*131t )
 DerailBufferForce ( 500kN )
 NumWheels ( 12 )
 Friction (
  1459N/m/s    0    1mph    11.54N/m/s    1.8
  5.1N/rad/s  1  -1rad/s  0  1
 )

 

 BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 460kN )

 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 40 )
 MaxApplicationRate( 40 )
 MaxAuxilaryChargingRate( 35 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 30 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

 IntakePoint ( 1.45 0.0 FuelDiesel )
 IntakePoint ( -1.45 0.0 FuelDiesel )

Lights	(	12

		Light	(
			comment( Front Red Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.85 1.5 9.05 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Front Red Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.85 1.5 9.05 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Front Marker Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -0.85 1.5 9.05 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Front Marker Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 0.85 1.5 9.05 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)		
		Light	(
			comment( Rear Red Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Rear Red Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Rear Marker Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Rear Marker Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
			Light	(
			comment( AI Front Marker left )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit	( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -0.85 1.5 9.05 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( AI Front Marker right )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit	( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 0.85 1.5 9.05 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)		
		Light	(
			comment( AI Rear Red left )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit	( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( AI Rear Red right )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit	( 2 )
				)
			FadeIn	( 0.25 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.85 1.5 -9.05 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)

		)


 Sound ("LMS10000eng.sms")
)

Engine ( 10001
 Effects (
  DieselSpecialEffects
  (
   Exhaust1
				(
					-0.35 3.95 -3.32
					0.25 1 0
					0.1
				)

				Exhaust2
				(
					0.35 3.95 1.2
					0.25 1 0
					0.1
				)

				Exhaust3
				(
					0.35 3.95 -3.32
					0.25 1 0
					0.1
				)


				Exhaust4
				(
					-0.35 3.95 1.2
					0.25 1 0
					0.1

   )
  )
 )

 Wagon ( 10001 )
 Type ( Diesel )
 MaxPower ( 1350hp )
 MaxForce ( 988.0kN )
 MaxContinuousForce ( 156kN )
 MaxCurrent ( 6000A  ) 
 RunUpTimeToMaxForce ( 30.0 )
 MaxDieselLevel( 900gal ) 
 MaxVelocity ( 105mph )
 comment( air gauge graph: 40-120psi)
 WheelRadius ( 21.0in )
 comment( sanding system is switched off when faster than given velocity )
 Sanding ( 6mph )
 NumWheels ( 1 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 EngineBrakesControllerMinPressureReduction( 6 )
 TrainBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 20 )
 TrainBrakesControllerMaxApplicationRate( 10 )
 EngineBrakesControllerMaxReleaseRate( 20 )
 TrainBrakesControllerMaxReleaseRate( 10 )
 EngineBrakesControllerEmergencyApplicationRate( 50 )
 TrainBrakesControllerEmergencyApplicationRate( 50 )
 EngineBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMinSystemPressure( 0 )
 EngineBrakesControllerMaxSystemPressure( 90 )
 TrainBrakesControllerMaxSystemPressure( 90 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
 EngineBrakesControllerFullServicePressureDrop( 26 )
 TrainBrakesControllerFullServicePressureDrop( 26 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Independent, Train" )

 EngineBrakesControllerDirectControlExponent( 1 )

 CabView ( LMS10000.cvf )
 HeadOut (  -1.465 2.8 7.3 )

 MaxDieselLevel ( 900gal )
 DieselUsedPerHourAtMaxPower ( 60gal )
 DieselUsedPerHourAtIdle ( 6.4gal )

 DieselSmokeEffectInitialMagnitude( 0.6 )
 DieselSmokeEffectMaxMagnitude( 2.0 )
 DieselSmokeEffectInitialSmokeRate( 0.4 )
 DieselSmokeEffectMaxSmokeRate( 2.5 )

 DieselEngineIdleRPM( 300 )
 DieselEngineMaxRPM( 750 )
 DieselEngineSpeedOfMaxTractiveEffort( 9.1mph )
 DieselEngineMaxRPMChangeRate( 200 )

 DoesHornTriggerBell( 0 )

 comment( infinate sanding time )
 MaxSandingTime( -1 )
 
 EngineControllers (
       Throttle ( 0 1 0.033 0
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.072   0 Dummy )
                    Notch ( 0.145    0 Dummy )
                    Notch ( 0.287   0 Dummy )
                    Notch ( 0.43     0 Dummy )
                    Notch ( 0.572   0 Dummy )
                    Notch ( 0.715   0 Dummy )
			    Notch ( 0.857  0 Dummy )
                    Notch ( 1       0 Dummy )
                )

  )
  Brake_Engine ( 0 1 0.033 0 
   NumNotches ( 1
    Notch ( 0       1 Dummy )                    
   )
  ) 
  Brake_Train ( 0 1 0.02 0.75 
   NumNotches ( 5
    Notch ( 0    0 TrainBrakesControllerReleaseStart )
    Notch ( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
    Notch ( 0.85 0 TrainBrakesControllerSuppressionStart )
    Notch ( 0.9  0 TrainBrakesControllerContinuousServiceStart )
    Notch ( 0.95 0 TrainBrakesControllerEmergencyStart )
   )
            )

  DirControl ( -1 0 1 1 )
  AWS ( 0 1 0 )
  Sanding ( 0 1 0 )
  Horn ( 0 1 0 )
  Wipers ( 0 1 0 )
  EmergencyStopToggle( 0 1 0 )
  Headlights ( 0 0.25 1 0 )
 )

 EngineVariables ( 750 )
 Sound ( "lms10000cab.sms" )

 Name ("10001 ")
    	Description (
	"Prototype Co-Co diesel-electric locomotive\n\n"+
	"Built by LMS/BR Derby 1947-1948\n\n"+
	"Numbers: 10000 - 10001\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power source: Diesel engine English Electric 16SVT 12cyl\n\n"+
	"Power: 1,600 hp @ 800rpm \n\n"+
	"Power at Rail: 1,200 hp \n\n"+
	"Maximum speed: 93 mph \n\n"+
	"Route Availability: 8 \n\n"+
	"Coupling Code: Special\n\n"+
	"Brake Force: 89tonnes, Type: Vacuum\n\n"+
	"Generator (rectified output): English Electric EE823A\n\n"+
	"Traction motors: Six English Electric EE519/1B\n\n"+
	"Maximum tractive effort: 41,400lbf \n\n"+
	"Wheel configuration: Twelve tapered tread in two 6 wheel bogies\n\n"+
	"Weight: 131 tons \n\n"+
	"Height: 12 ft. 11 1/4 in. (4.0 m)\n\n"+
	"Length: 61 ft. 2 in. (18.9 m)\n\n"+
	"Width: 9 ft. 3 in. (2.7 m)"


 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+  
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+  
 "To apply the dynamic brakes\n"+
 "1. Press the A key to move the throttle to the Idle position.\n"+
 "2. Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
 "To release the dynamic brakes\n"+
 "1. Press the D key to move the throttle towards Idle.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "4. Release the brakes.\n"+
 "5. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 )
)
